# SculptingCurvesTouchAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SculptingCurvesTouchAxis Property
BuiltInFailures..::..SketchFailures Class See Also
---
The highlighted curves touch the axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SculptingCurvesTouchAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SculptingCurvesTouchAxis As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SculptingCurvesTouchAxis {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace